let age = 22;
console.log(age);
age = 'john'//зміна типу змінної
console.log(age);
age = {name: 'vitaly',
hobby: '33'}
console.log(age);

const age2 = 22;
const isUserLoggetIn = true;
if(age2){//ця перевірка поверне true завжди окрім випадків наведених нище
    console.log('try');
}

//значення які завжди конвертуються в false
// 0
// -0
// null
// undefined
// NaN  - позначає результат неправильних арифметичних операцій(слово множимо на слово)
// '' -пустий рядок

//конвертація типів в арифметичні операції

let num1 = 10;
let str = 'mike';
console.log(num1 + str);//конкатинація(злиття значень в одне) відбувається тільки у випадках з додаванням в інших випадках відбувається конвертація

let num2 = 20;
let str2 = '5';
console.log(num2 - str2 );//тут відбувається конвертація
console.log(num2 * str2 );//тут відбувається конвертація
console.log(num2 / str2 );//тут відбувається конвертація


//методи
console.log(str.toUpperCase());//щоб викликати метод,після змінної ставимо крапку
let num3 = 23.2
console.log(num3.toFixed());//метод який заокруглює число

const num4 = null;//null автоматично конвертується в 0   
console.log(num2 + num4 );


//різниця між == та === полягає в тому що === перевіряє значення змінних також на їхній тип,
//і якщо він буде не однаковий,повернеться значення false.
//рекомендовано використовувати завжди ===